kauailabs/navxmxp/stm32/navx-mxp/navx-mxp.cpp
int current_yaw_history_size = YAW_HISTORY_PERIOD_MS
        / DEFAULT_MPU_SAMPLE_PERIOD_MS;
int current_world_accel_norm_history_size = WORLD_ACCEL_NORM_HISTORY_PERIOD_MS
        / DEFAULT_MPU_SAMPLE_PERIOD_MS;

void calculate_current_history_sizes()
{
    int sample_period_ms = 1000 / registers.update_rate_hz;
    current_yaw_history_size = YAW_HISTORY_PERIOD_MS / sample_period_ms;
    current_world_accel_norm_history_size = WORLD_ACCEL_NORM_HISTORY_PERIOD_MS / sample_period_ms;
}

/******************* TUNING VARIBLES ********************/

void init_history()
{
    for (int i = 0; i < WORLD_ACCEL_NORM_HISTORY_SIZE; i++) {
        world_accel_norm_history[i] = world_acceleration_norm_current_avg;
    }
    for (int i = 0; i < YAW_HISTORY_SIZE; i++) {
        yaw_history[i] = yaw_current_average;
    }
    calculate_current_history_sizes();
}

uint8_t *flashdata = 0;

static const uint8_t flash_fast = 0b10101010; /* Self-test Fail */
static const uint8_t flash_slow = 0b11111110; /* IMU Cal */
static const uint8_t flash_on   = 0b11111111; /* Startup, Mag Cal */
static const uint8_t flash_off  = 0b00000000;

volatile int8_t cal_led_cycle_index = 7;
volatile uint8_t cal_led_cycle = flash_on;
float last_gyro_bias_load_temperature = 0.0;

bool led_update_override = false;
uint8_t old_cal_led_cycle = flash_off;

void override_current_led_cycle( uint8_t new_cal_led_cycle )
{
    led_update_override = true;
    old_cal_led_cycle = cal_led_cycle;
    cal_led_cycle = new_cal_led_cycle;
    cal_led_cycle_index = 7;
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
    HAL_CAL_LED_On((cal_led_cycle & (1 << cal_led_cycle_index)) ? 1 : 0);
    cal_led_cycle_index--;
    if (cal_led_cycle_index < 0) {
        cal_led_cycle_index = 7;
        /* If override occurred, revert to previous */
        if ( led_update_override ) {
            led_update_override = false;
            cal_led_cycle = old_cal_led_cycle;
        }
    }
}

void calc_linear_temp_correction_coefficients( struct mpu_dmp_calibration_data *first,
        struct mpu_dmp_calibration_data *second,
        struct mpu_dmp_calibration_interpolation_coefficients *result )
{
    float delta_temp = fabs(first->mpu_temp_c - second->mpu_temp_c);
    float offset_first, offset_second, delta_offset;
    for ( int i = 0; i < 3; i++ ) {
        offset_first = ((float)first->gyro_bias_q16[i]) / 65536.0f;
        offset_second = ((float)second->gyro_bias_q16[i]) / 65536.0f;
        delta_offset = fabs(offset_second - offset_first);
        result->gyro_m[i] = delta_offset / delta_temp;
        result->gyro_b[i] = offset_first - (first->mpu_temp_c * result->gyro_m[i]);
    }
}

void interpolate_temp_correction_offsets( struct mpu_dmp_calibration_interpolation_coefficients *input,
        float temp_c,
        struct mpu_dmp_calibration_data *output )
{
    output->mpu_temp_c = temp_c;
    for ( int i = 0; i < 3; i++ ) {
        float gyro_output_float 	= (temp_c * input->gyro_m[i]) + input->gyro_b[i];
        output->gyro_bias_q16[i] 	= (long)(gyro_output_float * 65536.0f);
    }
}

uint16_t get_capability_flags()
{
    uint16_t capability_flags = 0;
    capability_flags |= (NAVX_CAPABILITY_FLAG_OMNIMOUNT +
            NAVX_CAPABILITY_FLAG_VEL_AND_DISP +
            NAVX_CAPABILITY_FLAG_YAW_RESET +
            NAVX_CAPABILITY_FLAG_AHRSPOS_TS +
            NAVX_CAPABILITY_FLAG_FW_REVISION +
            NAVX_CAPABILITY_FLAG_HIRES_TIMESTAMP);
    uint16_t yaw_axis_info =
            (((struct flash_cal_data *)flashdata)->orientationdata.yaw_axis << 1) +
            ((((struct flash_cal_data *)flashdata)->orientationdata.yaw_axis_up) ? 1 : 0);
    yaw_axis_info <<= 3;
    capability_flags |= yaw_axis_info;
    return capability_flags;
}

void update_capability_flags()
{
    registers.capability_flags = get_capability_flags();
}

int sense_current_yaw_orientation() {
    uint8_t mpu_yaw_axis;
    bool yaw_axis_up;
    if ( !sense_current_mpu_yaw_orientation( &mpu_yaw_axis, &yaw_axis_up) ) {
        ((struct flash_cal_data *)flashdata)->orientationdata.yaw_axis = mpu_yaw_axis;
        ((struct flash_cal_data *)flashdata)->orientationdata.yaw_axis_up = yaw_axis_up;
        return 0;
    }
    return -1;
}

uint8_t crc_lookup_table[256];

_EXTERN_ATTRIB void nav10_init()
{
    IMURegisters::buildCRCLookupTable(crc_lookup_table, sizeof(crc_lookup_table));

    registers.op_status		= NAVX_OP_STATUS_INITIALIZING;
    registers.hw_rev		= HAL_GetBoardRev();
    registers.identifier	= NAVX_MODEL_NAVX_MXP;
    registers.fw_major		= NAVX_MXP_FIRMWARE_VERSION_MAJOR;
    registers.fw_minor		= NAVX_MXP_FIRMWARE_VERSION_MINOR;
    registers.fw_revision	= NAVX_MXP_REVISION;
    read_unique_id(&chipid);
    update_capability_flags();

    __TIM11_CLK_ENABLE();
    /* Set Interrupt Group Priority; this is a low-priority interrupt */
    HAL_NVIC_SetPriority((IRQn_Type)TIM1_TRG_COM_TIM11_IRQn, 6, 0);
    /* Enable the TIMx global Interrupt */
    HAL_NVIC_EnableIRQ((IRQn_Type)TIM1_TRG_COM_TIM11_IRQn);
    /* Initialize low-priority, 125ms timer */
    TimHandle.Instance = TIM11;
    /* Compute the prescaler value to have TIM11 counter clock equal to 10 KHz */
    uint32_t uwPrescalerValue = (uint32_t) (SystemCoreClock / 10000) - 1;
    /* Initialize TIM11 peripheral for 250ms Interrupt */
    TimHandle.Init.Period = 2500 - 1;
    TimHandle.Init.Prescaler = uwPrescalerValue;
    TimHandle.Init.ClockDivision = 0;
    TimHandle.Init.CounterMode = TIM_COUNTERMODE_UP;
    HAL_TIM_Base_Init(&TimHandle);
    HAL_TIM_Base_Start_IT(&TimHandle); /* Enable timer interrupt */

    HAL_LED_Init();
    HAL_LED1_On(1);
    HAL_LED2_On(1);
    HAL_I2C_Power_Init();

    /* Ensure I2C is powered off, to handle case of a "soft" reset */
    HAL_I2C_Power_Off();
    HAL_Delay(50);

    if ( HAL_UART_Slave_Enabled() ) {
        Serial6.begin(57600);
    }

    /* Power on the on-board I2C devices */
    HAL_I2C_Power_On();
    HAL_Delay(1000);

    FlashStorage.init(sizeof(flash_cal_data));

    /* Initiate Data Reception on slave SPI Interface, if it is enabled. */
    if ( HAL_SPI_Slave_Enabled() ) {
        HAL_SPI_Receive_DMA(&hspi1, (uint8_t *)spi1_RxBuffer, SPI_RECV_LENGTH);
        HAL_SPI_Comm_Ready_Assert();
    }

    ext_spi_init_complete = true;

    mpu_initialize(MPU9250_INT_Pin);
    enable_dmp();

    HAL_LED1_On(0);
    HAL_LED2_On(0);
    uint16_t flashdatasize;
    bool flashdatavalid;
    bool mpu_cal_complete = false;
    bool mag_cal_complete = false;
    registers.cal_status = NAVX_CAL_STATUS_IMU_CAL_INPROGRESS;
    registers.selftest_status = 0;
    flashdata = FlashStorage.get_mem(flashdatavalid,flashdatasize);
    if ( ( flashdatavalid ) &&
            ( flashdatasize == sizeof(struct flash_cal_data) ) ) {
        if ( ((struct flash_cal_data *)flashdata)->dmpcaldatavalid ) {
            mpu_apply_calibration_data( &((struct flash_cal_data *)flashdata)->mpucaldata );
            mpu_apply_dmp_gyro_biases(&((struct flash_cal_data *)flashdata)->dmpcaldata);
            set_current_mpu_to_board_xform(((struct flash_cal_data *)flashdata)->orientationdata.yaw_axis,
                    ((struct flash_cal_data *)flashdata)->orientationdata.yaw_axis_up);
            update_capability_flags();
            last_gyro_bias_load_temperature = ((struct flash_cal_data *)flashdata)->dmpcaldata.mpu_temp_c;
            cal_led_cycle = flash_off;
            registers.op_status = NAVX_OP_STATUS_NORMAL;
            registers.cal_status |= NAVX_CAL_STATUS_IMU_CAL_ACCUMULATE;
            mpu_cal_complete = true;
        }
        if ( !is_mag_cal_data_default(&((struct flash_cal_data *)flashdata)->magcaldata) ) {
            mpu_apply_mag_cal_data(&((struct flash_cal_data *)flashdata)->magcaldata);
            registers.cal_status |= NAVX_CAL_STATUS_MAG_CAL_COMPLETE;
            mag_cal_complete = true;
        }
        registers.selftest_status = ((struct flash_cal_data *)flashdata)->selfteststatus | NAVX_SELFTEST_STATUS_COMPLETE;
    }

    /* If no MPU calibration data exists, detect yaw orientation, and run self tests which */
    /* will acquire MPU calibration data.  Note that the self-tests require correct yaw    */
    /* orientation in order to return correct results.                                     */

    if ( !mpu_cal_complete ) {
        cal_led_cycle = flash_slow;
        registers.op_status = NAVX_OP_STATUS_SELFTEST_IN_PROGRESS;
        uint8_t selftest_status = 0;
        while ( selftest_status != 7 ) {
            if ( !sense_current_yaw_orientation() ) {
                set_current_mpu_to_board_xform(((struct flash_cal_data *)flashdata)->orientationdata.yaw_axis,
                        ((struct flash_cal_data *)flashdata)->orientationdata.yaw_axis_up);
                selftest_status = run_mpu_self_test(&((struct flash_cal_data *)flashdata)->mpucaldata,
                        ((struct flash_cal_data *)flashdata)->orientationdata.yaw_axis,
                        ((struct flash_cal_data *)flashdata)->orientationdata.yaw_axis_up);
                if ( selftest_status == 7 ) {
                    /* Self-test passed */
                    update_capability_flags();
                    mpu_apply_calibration_data(&((struct flash_cal_data *)flashdata)->mpucaldata);
                    /* Retrieve default magnetometer calibration data */
                    mpu_get_mag_cal_data(&((struct flash_cal_data *)flashdata)->magcaldata);
                    init_fusion_settings(&((struct flash_cal_data *)flashdata)->fusiondata);
                    ((struct flash_cal_data *)flashdata)->selfteststatus = selftest_status;
                    registers.selftest_status = selftest_status | NAVX_SELFTEST_STATUS_COMPLETE;
                    registers.op_status = NAVX_OP_STATUS_IMU_AUTOCAL_IN_PROGRESS;
                    registers.cal_status |= NAVX_CAL_STATUS_IMU_CAL_INPROGRESS;
                    cal_led_cycle = flash_slow;
                } else {
                    /* Self-test failed, and we have no calibration data. */
                    /* Indicate error, and continue retrying.             */
                    cal_led_cycle = flash_fast;
                    registers.op_status = NAVX_OP_STATUS_ERROR;
                    registers.selftest_status = selftest_status;
                    /* Re-detect MPU on I2C bus */
                    HAL_LED2_On( mpu_detect() ? 1 : 0);
                }
            } else {
                /* Couldn't sense yaw orientation axis.  The board needs to be held still and */
                /* with one of the axes perpendicular to the earth.  Continue retrying...     */
            }
        }
    }

    /* Configure device and external communication interrupts */

    GPIO_InitTypeDef GPIO_InitStruct;

    /*Configure GPIO pin : PC8 (MPU) for rising-edge interrupts */
    GPIO_InitStruct.Pin = MPU9250_INT_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(MPU9250_INT_GPIO_Port, &GPIO_InitStruct);

    /* Configure GPIO pin : PC9 (CAL Button) for dual-edge interrupts */
    GPIO_InitStruct.Pin = CAL_BTN_Pin;
    GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING_FALLING;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(CAL_BTN_GPIO_Port, &GPIO_InitStruct);

    /* EXTI interrupt initialization */
    /* TODO:  Review this priority post-integration of navX-PI HAL. */
    HAL_NVIC_SetPriorityGrouping(NVIC_PRIORITYGROUP_4/*NVIC_PRIORITYGROUP_0*/);
    HAL_NVIC_SetPriority((IRQn_Type)EXTI9_5_IRQn, 5, 0);
    HAL_NVIC_EnableIRQ((IRQn_Type)EXTI9_5_IRQn);

