kauailabs/navxmxp/stm32/navx-mxp/navx-mxp.cpp
    /* NavX-PI:  Enable EXTI on pins 10-15 */
    if((MPU9250_INT_Pin > GPIO_PIN_9) ||(CAL_BTN_Pin > GPIO_PIN_9)) {
        HAL_NVIC_SetPriority((IRQn_Type)EXTI15_10_IRQn, 5, 0);
        HAL_NVIC_EnableIRQ((IRQn_Type)EXTI15_10_IRQn);
    }

    /* Initiate Data Reception on slave I2C Interface */
#ifndef DISABLE_EXTERNAL_I2C_INTERFACE
    prepare_next_i2c_receive();
#endif
}

struct mpu_data mpudata;
struct mpu_config mpuconfig;
unsigned long last_scan = 0;
bool calibration_active = false;
unsigned long cal_button_pressed_timestamp = 0;
unsigned long reset_imu_cal_buttonpress_period_ms = 2000;

bool schedule_caldata_clear = false;    /* Request by user to clear cal data */
int caldata_clear_count = 0;            /* Protection against flash wear */

#define BUTTON_DEBOUNCE_SAMPLES 10

static void cal_button_isr(uint8_t gpio_pin)
{
    /* If CAL button held down for sufficient duration, clear accel/gyro cal data */
    bool button_pressed = false;

    /* De-bounce the CAL button */

    int button_pressed_count = 0;
    for ( int i = 0; i < BUTTON_DEBOUNCE_SAMPLES; i++) {
        if ( HAL_CAL_Button_Pressed() ) {
            button_pressed_count++;
        }
    }
    if ( button_pressed_count > (BUTTON_DEBOUNCE_SAMPLES/2) ) {
        button_pressed = true;
    }

    if ( button_pressed ) {
        cal_button_pressed_timestamp = HAL_GetTick();
    } else {
        if ( (HAL_GetTick() - cal_button_pressed_timestamp) >= reset_imu_cal_buttonpress_period_ms) {
            if ( registers.op_status == NAVX_OP_STATUS_NORMAL ) {
                schedule_caldata_clear = true;
            }
        }
    }
}

int set_tuning_var( AHRS_DATA_ACTION action, AHRS_TUNING_VAR_ID tuning_var_id, float tuning_value, bool write )
{
    int status;
    if ( action == DATA_SET_TO_DEFAULT ) {
        if ( tuning_var_id == UNSPECIFIED ) {
            for ( int i = MIN_TUNING_VAR_ID; i <= MAX_TUNING_VAR_ID; i++ ) {
                status = set_tuning_var( action, (AHRS_TUNING_VAR_ID)i, 0.0f, false);
            }
        } else {
            struct fusion_settings default_fusion_settings;
            struct mag_calibration_data default_magcaldata;
            init_fusion_settings(&default_fusion_settings);

            switch ( tuning_var_id ) {
            case MOTION_THRESHOLD:
                status = set_tuning_var( DATA_SET, MOTION_THRESHOLD, default_fusion_settings.motion_detect_thresh_g, false);
                break;
            case YAW_STABLE_THRESHOLD:
                status = set_tuning_var( DATA_SET, YAW_STABLE_THRESHOLD, default_fusion_settings.yaw_change_detect_thresh_deg, false);
                break;
            case SEA_LEVEL_PRESSURE:
                status = set_tuning_var( DATA_SET, SEA_LEVEL_PRESSURE, default_fusion_settings.sealevel_pressure_millibars, false);
                break;
            case MAG_DISTURBANCE_THRESHOLD:
                get_default_mag_cal_data(&default_magcaldata);
                status = set_tuning_var( DATA_SET, MAG_DISTURBANCE_THRESHOLD, default_magcaldata.mag_disturbance_ratio, false);
                break;
            case UNSPECIFIED:
            default:
                status = DATA_GETSET_ERROR;
                break;
            }
        }
    } else if ( action == DATA_SET ) {
        switch ( tuning_var_id ) {
        case MOTION_THRESHOLD:
            (((struct flash_cal_data *)flashdata)->fusiondata).motion_detect_thresh_g = tuning_value;
            status = DATA_GETSET_SUCCESS;
            break;
        case YAW_STABLE_THRESHOLD:
            (((struct flash_cal_data *)flashdata)->fusiondata).yaw_change_detect_thresh_deg = tuning_value;
            status = DATA_GETSET_SUCCESS;
            break;
        case SEA_LEVEL_PRESSURE:
            (((struct flash_cal_data *)flashdata)->fusiondata).sealevel_pressure_millibars = tuning_value;
            status = DATA_GETSET_SUCCESS;
            break;
        case MAG_DISTURBANCE_THRESHOLD:
            (((struct flash_cal_data *)flashdata)->magcaldata).mag_disturbance_ratio = tuning_value;
            mpu_apply_mag_cal_data(&((struct flash_cal_data *)flashdata)->magcaldata);
            status = DATA_GETSET_SUCCESS;
            break;
        default:
            status = DATA_GETSET_ERROR;
            break;
        }
    } else {
        status = DATA_GETSET_ERROR; /* Get Response (not implemented on navX MXP) */
    }
    if ( write && ( status == DATA_GETSET_SUCCESS ) ) {
        status = (FlashStorage.commit() == HAL_OK) ? 0 : 1;
    }
    return status;
}

unsigned long start_timestamp = 0;	/* The time the "main" started. */
/* The time period (after the start timestamp) after which the yaw  */
/* offset calculation process will timeout.                         */
unsigned long yaw_offset_startup_timeout_ms = 20000;

/*****************************************
 * MPU Calibration
 *****************************************/

int yaw_offset_accumulator_count = 0;
float yaw_accumulator = 0.0;
float calibrated_yaw_offset = 0.0;
int imu_cal_bias_change_count = 0;
bool yaw_offset_calibration_complete = false;
unsigned long last_temp_compensation_check_timestamp = 0;

void update_config() {
    get_mpu_config(&mpuconfig);
    registers.accel_fsr_g = mpuconfig.accel_fsr;
    registers.gyro_fsr_dps = mpuconfig.gyro_fsr;
    registers.update_rate_hz = (uint8_t)mpuconfig.mpu_update_rate;
}

struct mpu_dmp_calibration_data curr_dmpcaldata;
struct mpu_dmp_calibration_data test_dmpcaldata;
struct mpu_dmp_calibration_interpolation_coefficients temp_correction_coefficients;
bool temp_correction_coefficients_valid = false;

PrintSerialReceiver* serial_interfaces[NUM_STREAMING_INTERFACES] = {&SerialUSB,&Serial6};
uint32_t last_packet_start_rx_timestamp[NUM_STREAMING_INTERFACES] = {0,0};
int num_serial_interfaces = 1;
/* Signal that sample rate has been updated by remote user */
bool sample_rate_update = true;
uint8_t new_sample_rate = 0;
/* Signal that integration control has been updated by remote user */
bool integration_control_update = true;
volatile uint8_t new_integration_control = 0;
uint32_t i2c_bus_reset_count = 0;
uint32_t i2c_interrupt_reset_count = 0;

