kauailabs/navxmxp/stm32/navx-mxp/navx-mxp.cpp
_EXTERN_ATTRIB void nav10_main()
{
    unsigned long timestamp;
    int uart_slave_enabled = HAL_UART_Slave_Enabled();
    if (uart_slave_enabled) {
        num_serial_interfaces++;
    }

    attachInterrupt(CAL_BTN_Pin,&cal_button_isr,CHANGE);

    if ( start_timestamp == 0 ) {
        start_timestamp = HAL_GetTick();
    }

    while (1)
    {
        bool send_stream_response[2] = { false, false };
        bool send_mag_cal_response[2] = { false, false };
        bool send_tuning_var_set_response[2] = { false, false };
        bool send_data_retrieval_response[2] = {false, false};
        bool send_integration_control_response[2] = {false,false};
        uint8_t tuning_var_status = 0;
        AHRS_TUNING_VAR_ID tuning_var_id = UNSPECIFIED, retrieved_var_id = UNSPECIFIED;
        AHRS_DATA_TYPE retrieved_data_type = BOARD_IDENTITY;
        AHRS_DATA_ACTION data_action = DATA_GET;
        uint8_t integration_control_action = 0;
        int32_t integration_control_parameter = 0;
        int num_update_bytes[2] = { 0, 0 };
        int num_resp_bytes[2] = { 0, 0 };

        periodic_compass_update();

        SpiTxTimeoutCheck();

        if ( sample_rate_update ) {
            if ( new_sample_rate != 0 ) {
                mpu_set_new_sample_rate(new_sample_rate);
                new_sample_rate = 0;
            }
            update_config();
            init_history();
            sample_rate_update = false;
            send_stream_response[0] = true;
            send_stream_response[1] = true;
        }

        if ( integration_control_update ) {

        	/* Read/Modify/Write integration control register */
			NVIC_DisableIRQ((IRQn_Type)I2C3_EV_IRQn);
			NVIC_DisableIRQ((IRQn_Type)SPI1_IRQn);
	        NVIC_DisableIRQ((IRQn_Type)DMA2_Stream0_IRQn);
			integration_control_update = false;
			uint8_t curr_vel_disp_int_control = new_integration_control & NAVX_INTEGRATION_CTL_VEL_AND_DISP_MASK;
			uint8_t curr_yaw_int_control = new_integration_control & NAVX_INTEGRATION_CTL_RESET_YAW;
			new_integration_control &= ~(curr_vel_disp_int_control | curr_yaw_int_control);
	        NVIC_EnableIRQ((IRQn_Type)DMA2_Stream0_IRQn);
			NVIC_EnableIRQ((IRQn_Type)SPI1_IRQn);
			NVIC_EnableIRQ((IRQn_Type)I2C3_EV_IRQn);

        	if ( curr_vel_disp_int_control != 0 ) {
        		reset_velocity_and_dispacement_integrator(&mpudata,curr_vel_disp_int_control);
        	}

            if ( curr_yaw_int_control != 0 ) {
                if ( yaw_offset_calibration_complete ) {
                    /* Current yaw angle now becomes zero degrees */
                    float curr_yaw_offset;
                    /* Disable MPU interrupts around the following
                     * pair of calls to get_yaw_offset() and set_yaw_offset(),
                     * while changing the yaw offset (which is used in the
                     * interrupt handler).
                     */
                    HAL_NVIC_DisableIRQ((IRQn_Type)EXTI9_5_IRQn);
                    get_yaw_offset(&curr_yaw_offset);
                    calibrated_yaw_offset = mpudata.yaw + curr_yaw_offset;
                    registers.yaw_offset = IMURegisters::encodeSignedHundredthsFloat(calibrated_yaw_offset);
                    /* Note:  protect against a race condition in which multiple
                     * Zero Yaw commands are received before the next MPU
                     * interrupt occurs.  In this condition, the mpudata.yaw value
                     * will not have been updated by the MPU interrupt.  Therefore,
                     * set the mpudata.yaw value to 0 immediately here. */
                    mpudata.yaw = 0.0f;
                    set_yaw_offset(calibrated_yaw_offset);
                    HAL_NVIC_EnableIRQ((IRQn_Type)EXTI9_5_IRQn);
                }
            }
        }

        if ( schedule_caldata_clear && ( caldata_clear_count < 3 ) ) {
            /* Ensure that the CAL LED is lit for one second */
            HAL_CAL_LED_On(1);
            override_current_led_cycle( flash_on );
            /* clear the "valid calibration" flag and self-test results, write to flash */
            ((struct flash_cal_data *)flashdata)->dmpcaldatavalid = false;
            ((struct flash_cal_data *)flashdata)->selfteststatus = 0;
            FlashStorage.commit();
            schedule_caldata_clear = false;
            caldata_clear_count++;
        }

        if ( dmp_data_ready() ) {
            HAL_LED1_On(1);
            if ( get_dmp_data(&mpudata) == 0 ) {
                last_scan = HAL_GetTick();
                HAL_LED2_On(1);

                registers.yaw 		= IMURegisters::encodeSignedHundredthsFloat(mpudata.yaw);
                registers.pitch 	= IMURegisters::encodeSignedHundredthsFloat(mpudata.pitch);
                registers.roll 		= IMURegisters::encodeSignedHundredthsFloat(mpudata.roll);
                registers.heading	= IMURegisters::encodeUnsignedHundredthsFloat(mpudata.heading);
                registers.fused_heading = IMURegisters::encodeUnsignedHundredthsFloat(mpudata.fused_heading);
                registers.mpu_temp_c = IMURegisters::encodeSignedHundredthsFloat(mpudata.temp_c);
                registers.altitude = 0; 					/* Todo:  update from pressure sensor */
                registers.barometric_pressure = 0;			/* Todo:  update from pressure sensor */
                registers.pressure_sensor_temp_c = 0;		/* Todo:  update from pressure sensor */
                registers.timestamp = mpudata.timestamp;
                registers.hires_timestamp = mpudata.hires_timestamp;
                for ( int i = 0; i < 4; i++ ) {
                    registers.quat[i] = IMURegisters::encodeRatioFloat(
                            (float)(mpudata.quaternion[i] >> 16) / 16384.0f);
                }
                for ( int i = 0; i < 3; i++ ) {
                    registers.world_linear_accel[i] = IMURegisters::encodeSignedThousandthsFloat(
                            mpudata.world_linear_accel[i]);
                    registers.mag_raw[i]			= mpudata.calibrated_compass[i];
                    registers.accel_raw[i]			= mpudata.raw_accel[i];
                    registers.gyro_raw[i]			= mpudata.raw_gyro[i];
                    IMURegisters::encodeProtocol1616Float( mpudata.velocity[i], (char *)&registers.velocity[i]);
                    IMURegisters::encodeProtocol1616Float( mpudata.displacement[i], (char *)&registers.displacement[i]);
                }

                /* Peform motion detection, a deviation from the norm of world linear accel (X and Y axes) */
                float world_linear_accel_norm = fabs( sqrt( fabs (mpudata.world_linear_accel[0]*mpudata.world_linear_accel[0]) +
                        fabs (mpudata.world_linear_accel[1]*mpudata.world_linear_accel[1]) ) );
                world_accel_norm_history[world_acceleration_history_index] = world_linear_accel_norm;
                world_acceleration_history_index = (world_acceleration_history_index + 1) % current_world_accel_norm_history_size;
                float world_acceleration_history_sum = 0;
                for ( int i = 0; i < current_world_accel_norm_history_size; i++ ) {
                    world_acceleration_history_sum += world_accel_norm_history[i];
                }
                world_acceleration_norm_current_avg = world_acceleration_history_sum / current_world_accel_norm_history_size;
                if ( world_acceleration_norm_current_avg > (((struct flash_cal_data *)flashdata)->fusiondata).motion_detect_thresh_g ) {
                    registers.sensor_status |= NAVX_SENSOR_STATUS_MOVING;
                } else {
                    registers.sensor_status &= ~NAVX_SENSOR_STATUS_MOVING;
                }
                if ( mpudata.fused_heading_valid ) {
                    registers.sensor_status |= NAVX_SENSOR_STATUS_FUSED_HEADING_VALID;
                } else {
                    registers.sensor_status &= ~NAVX_SENSOR_STATUS_FUSED_HEADING_VALID;
                }

