kauailabs/navxmxp/stm32/navx-mxp/navx-mxp.cpp
                    }
                    else if ( update_type[ifx] == MSGID_QUATERNION_UPDATE ) {

                        num_update_bytes[ifx] = IMUProtocol::encodeQuaternionUpdate( update_buffer[ifx],
                                mpudata.quaternion[0] >> 16,
                                mpudata.quaternion[1] >> 16,
                                mpudata.quaternion[2] >> 16,
                                mpudata.quaternion[3] >> 16,
                                mpudata.raw_accel[0],
                                mpudata.raw_accel[1],
                                mpudata.raw_accel[2],
                                mpudata.calibrated_compass[0],
                                mpudata.calibrated_compass[1],
                                mpudata.calibrated_compass[2],
                                mpudata.temp_c );

                    } else if ( update_type[ifx] == MSGID_GYRO_UPDATE ) {

                        num_update_bytes[ifx] = IMUProtocol::encodeGyroUpdate( update_buffer[ifx],
                                mpudata.raw_gyro[0],
                                mpudata.raw_gyro[1],
                                mpudata.raw_gyro[2],
                                mpudata.raw_accel[0],
                                mpudata.raw_accel[1],
                                mpudata.raw_accel[2],
                                mpudata.calibrated_compass[0],
                                mpudata.calibrated_compass[1],
                                mpudata.calibrated_compass[2],
                                mpudata.temp_c );

                    } else {

                        num_update_bytes[ifx] = IMUProtocol::encodeYPRUpdate( update_buffer[ifx],
                                mpudata.yaw,
                                mpudata.pitch,
                                mpudata.roll,
                                mpudata.heading);
                    }
                }

                if ( registers.op_status == NAVX_OP_STATUS_IMU_AUTOCAL_IN_PROGRESS ) {

                    if ( mpu_did_dmp_gyro_biases_change(&((struct flash_cal_data *)flashdata)->dmpcaldata) ) {
                        imu_cal_bias_change_count++;
                    }

                    if ( ( ( registers.sensor_status & NAVX_SENSOR_STATUS_MOVING ) == 0 ) &&
                            ( ( registers.sensor_status & NAVX_SENSOR_STATUS_YAW_STABLE ) ) &&
                            ( imu_cal_bias_change_count > 2 ) ) {

                        /* Sensor is still, and DMP calibration constants have been accumulated */
                        /* Store to flash memory and begin accumulating yaw offsets.            */

                        registers.cal_status &= ~NAVX_CAL_STATUS_IMU_CAL_STATE_MASK;
                        registers.cal_status |= NAVX_CAL_STATUS_IMU_CAL_ACCUMULATE;
                        cal_led_cycle = flash_off;
                        ((struct flash_cal_data *)flashdata)->dmpcaldatavalid = true;
                        FlashStorage.commit();
                        registers.op_status = NAVX_OP_STATUS_NORMAL;
                        start_timestamp = HAL_GetTick();
                        /* Reset integration of velocity/displacement on all axes */
                        reset_velocity_and_dispacement_integrator(&mpudata,0x3F);
                    }
                }

                if ( registers.op_status == NAVX_OP_STATUS_NORMAL ) {

                    /* Accumulate yaw offset if not yet completely acquired. */

                    if ( !yaw_offset_calibration_complete ) {
                        if ( ( ( registers.sensor_status & NAVX_SENSOR_STATUS_MOVING ) == 0 ) &&
                                ( registers.sensor_status & NAVX_SENSOR_STATUS_YAW_STABLE ) ) {

                            yaw_accumulator += mpudata.yaw;
                            yaw_offset_accumulator_count++;

                            if ( yaw_offset_accumulator_count >= current_yaw_history_size ) {

                                registers.cal_status &= ~NAVX_CAL_STATUS_IMU_CAL_STATE_MASK;
                                registers.cal_status |= NAVX_CAL_STATUS_IMU_CAL_COMPLETE;

                                calibrated_yaw_offset = yaw_accumulator / yaw_offset_accumulator_count;
                                registers.yaw_offset = IMURegisters::encodeSignedHundredthsFloat(calibrated_yaw_offset);
                                set_yaw_offset(calibrated_yaw_offset);
                                yaw_offset_calibration_complete = true;
                                send_stream_response[0] = true;
                                send_stream_response[1] = true;
                                last_temp_compensation_check_timestamp = HAL_GetTick();
                                /* Reset integration of velocity/displacement on all axes */
                                reset_velocity_and_dispacement_integrator(&mpudata,0x3F);
                            }
                        } else {

                            if ( ( last_scan - start_timestamp ) > yaw_offset_startup_timeout_ms ) {

                                /* Timed out waiting for inital yaw offset accumulation.  This case */
                                /* can occur if the sensor is not still during the startup timeout  */
                                /* period.  In this case, set yaw/quat offsets to 0.                */

                                registers.cal_status &= ~NAVX_CAL_STATUS_IMU_CAL_STATE_MASK;
                                registers.cal_status |= NAVX_CAL_STATUS_IMU_CAL_COMPLETE;
                                calibrated_yaw_offset = 0.0f;
                                registers.yaw_offset = IMURegisters::encodeSignedHundredthsFloat(calibrated_yaw_offset);
                                set_yaw_offset(calibrated_yaw_offset);
                                yaw_offset_calibration_complete = true;
                                send_stream_response[0] = true;
                                send_stream_response[1] = true;
                                last_temp_compensation_check_timestamp = HAL_GetTick();
                                /* Reset integration of velocity/displacement on all axes */
                                reset_velocity_and_dispacement_integrator(&mpudata,0x3F);

                            } else {
                                yaw_offset_accumulator_count = 0;
                                yaw_accumulator = 0.0;
                            }
                        }
                    }

