kauailabs/navxmxp/stm32/navx-mxp/navx-mxp.cpp
                    /* Periodically check for new dmp gyro biases if the temperature has changed. */

                    if ( ( last_scan - last_temp_compensation_check_timestamp ) > 1000 ) {
                        last_temp_compensation_check_timestamp = last_scan;
                        if ( ( ( registers.sensor_status & NAVX_SENSOR_STATUS_MOVING ) == 0 ) &&
                                ( registers.sensor_status & NAVX_SENSOR_STATUS_YAW_STABLE ) ) {
                            if ( mpu_did_dmp_gyro_biases_change(&curr_dmpcaldata) ) {
                                if ( fabs( curr_dmpcaldata.mpu_temp_c -
                                        ((struct flash_cal_data *)flashdata)->dmpcaldata.mpu_temp_c) >= 2.0 ) {
                                    calc_linear_temp_correction_coefficients( 	&(((struct flash_cal_data *)flashdata)->dmpcaldata),
                                            &curr_dmpcaldata,
                                            &temp_correction_coefficients);
                                    temp_correction_coefficients_valid = true;
                                }
                            }
                        }

                        /* Periodically re-calculate dmp gyro biases based upon current temperature */
                        if ( temp_correction_coefficients_valid ) {
                            interpolate_temp_correction_offsets( 	&temp_correction_coefficients,
                                    mpudata.temp_c,
                                    &test_dmpcaldata );
                            /* If temperature compensation slope is active */
                            /* read temp and apply new biases if temperature shift is detected */
                            if ( fabs( last_gyro_bias_load_temperature - mpudata.temp_c ) > .25 ) {
                                //mpu_apply_dmp_biases(&test_dmpcaldata); NOT WORKING VERY WELL YET
                                //last_gyro_bias_load_temperature = mpudata.temp_c;
                            }
                        }
                    }
                }
            } else {
                /* Error retrieving dmp data - possible I2C error. */
                bool mpu_present = mpu_detect();
                HAL_LED2_On( mpu_present ? 1 : 0);
                if ( !mpu_present ) {
                    timestamp = HAL_GetTick();
                    uint32_t max_wait_ms = 3 * (1000 / registers.update_rate_hz);
                    if ( ( last_scan > 0 ) && ( timestamp - last_scan > max_wait_ms ) ) {
                        bool bus_error = (__HAL_I2C_GET_FLAG(&hi2c2, I2C_FLAG_BERR) == SET);
                        bool bus_busy = (__HAL_I2C_GET_FLAG(&hi2c2, I2C_FLAG_BUSY) == SET);
                        if( bus_error || bus_busy ) {
                            /* Bus Busy, or Bus Error.  Reset the I2C Interface, in an attempt */
                            /* to resolve this condition.                                      */
                            HAL_I2C_Reset(&hi2c2);
                            i2c_bus_reset_count++;
                            //HAL_I2C_Reset(&hi2c2);
                            last_scan = HAL_GetTick();
                        }
                    }
                }
            }
        } else {
            /* No Data Ready Interrupt received */
            timestamp = HAL_GetTick();
            uint32_t max_wait_ms = 6 * (1000 / registers.update_rate_hz);
            if ( ( last_scan > 0 ) && ( timestamp - last_scan > max_wait_ms ) ) {
                HAL_LED1_On(0);
                HAL_LED2_On(0);
                uint32_t temp;
                bool group_enabled = false;
                bool pin_masked_in = false;
                bool rising_edge_trigger = false;
                bool falling_edge_trigger = false;
                bool pull_up_direction = false;
                if ((MPU9250_INT_GPIO_Port == GPIOC) || (MPU9250_INT_GPIO_Port == GPIOD)){
                	// MPU Interrupt is in Group C or D
                	temp = SYSCFG->EXTICR[2];
                }
                if ( temp & 0x00000003 ) {
                    /* EXTI8 is enabled for GPIOC/GPIOD Group */
                    group_enabled = true;
                }
                temp = EXTI->IMR;
                if ( temp & 0x00000100 ) {
                    /* GPIO 8 is masked in */
                    pin_masked_in = true;
                }
                temp = EXTI->RTSR;
                if ( temp & 0x00000100 ) {
                    /* GPIO 8 is rising edge triggered */
                    rising_edge_trigger = true;
                }
                temp = EXTI->FTSR;
                if ( temp & 0x00000100 ) {
                    /* GPIO 8 is falling edge triggered */
                    falling_edge_trigger = true;
                }
                temp = GPIOC->PUPDR;
                if ( temp & 0x0001000 ) {
                    /* GPIO 8 is pull-up direction */
                    pull_up_direction = true;
                }

                if (!group_enabled || !pin_masked_in || !rising_edge_trigger || falling_edge_trigger || pull_up_direction) {
					/* HACK:  For some reason, in certain error cases (e.g., when  */
					/* power to I2C/SPI/UART is removed and then re-applied), the  */
					/* PC8 Interrupt Mask is disabled.  For the navX-MXP, this     */
					/* condition causes further MPU interrupts to be missed.       */
					/* Therefore, whenever this condition is detected, re-         */
					/* configure GPIO pin : PC8 (MPU) for rising-edge interrupts   */
					GPIO_InitTypeDef GPIO_InitStruct;

					GPIO_InitStruct.Pin = GPIO_PIN_8;
					GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING;
					GPIO_InitStruct.Pull = GPIO_NOPULL;
					HAL_GPIO_Init(MPU9250_INT_GPIO_Port, &GPIO_InitStruct);
					i2c_interrupt_reset_count++;
                }
				last_scan = timestamp;
#ifdef DEBUG_I2C_COMM
                for ( int ifx = 0; ifx < num_serial_interfaces; ifx++ ) {
                    serial_interfaces[ifx]->println("Scanning");
                }
#endif
            }
        }

        /* Process inbound configuration requests */
        for ( int ifx = 0; ifx < num_serial_interfaces; ifx++ ) {
            /* Scan for start of message, discarding any bytes that precede it. */
            bool found_start_of_message = false;
            while ( serial_interfaces[ifx]->available() > 0 ) {
                char rcv_byte = serial_interfaces[ifx]->peek();
                if ( rcv_byte != PACKET_START_CHAR ) {
                    serial_interfaces[ifx]->read();
                }
                else {
                    if ( last_packet_start_rx_timestamp[ifx] == 0 ) {
                        last_packet_start_rx_timestamp[ifx] = HAL_GetTick();
                    }
                    found_start_of_message = true;
                    break;
                }
            }

            /* If packet start recently found, but insufficient bytes have been */
            /* received after waiting the maximum packet rx time, flush the     */
            /* packet start Indicator.                                          */
            if ( found_start_of_message &&
                    serial_interfaces[ifx]->available() < MIN_UART_MESSAGE_LENGTH &&
                    HAL_GetTick() - last_packet_start_rx_timestamp[ifx] > (uint32_t)UART_RX_PACKET_TIMEOUT_MS ) {
                /* Flush the start of message indicator. */
                serial_interfaces[ifx]->read();
                last_packet_start_rx_timestamp[ifx] = 0;
                break;
            }

            /* If sufficient bytes have been received, process the data and */
            /* if a valid message is received, handle it.                   */

            if( found_start_of_message && ( serial_interfaces[ifx]->available() >= MIN_UART_MESSAGE_LENGTH ) ) {
                size_t bytes_read = 0;
                last_packet_start_rx_timestamp[ifx] = 0;
                while ( serial_interfaces[ifx]->available() ) {
                    if ( bytes_read >= sizeof(inbound_data) ) {
                        break;
                    }
                    inbound_data[bytes_read++] = serial_interfaces[ifx]->read();
                }

