kauailabs/navxmxp/stm32/navx-mxp/navx-mxp.cpp
            if ( send_stream_response[ifx] ) {
                uint16_t flags = (registers.op_status == NAVX_OP_STATUS_IMU_AUTOCAL_IN_PROGRESS) ?
                        NAV6_CALIBRATION_STATE_WAIT : (yaw_offset_calibration_complete ?
                                NAV6_CALIBRATION_STATE_COMPLETE : NAV6_CALIBRATION_STATE_ACCUMULATE );
                flags |= get_capability_flags();
                num_resp_bytes[ifx] += IMUProtocol::encodeStreamResponse(  response_buffer[ifx] + num_resp_bytes[ifx], update_type[ifx],
                        mpuconfig.gyro_fsr, mpuconfig.accel_fsr, mpuconfig.mpu_update_rate, calibrated_yaw_offset,
                        0,
                        0,
                        0,
                        0,
                        flags );
            }
            if ( send_mag_cal_response[ifx] ) {
                num_resp_bytes[ifx] += AHRSProtocol::encodeDataSetResponse(response_buffer[ifx] + num_resp_bytes[ifx], MAG_CALIBRATION, UNSPECIFIED, DATA_GETSET_SUCCESS);
            }
            if ( send_tuning_var_set_response[ifx] ) {
                num_resp_bytes[ifx] += AHRSProtocol::encodeDataSetResponse(response_buffer[ifx] + num_resp_bytes[ifx], TUNING_VARIABLE, tuning_var_id, tuning_var_status);
            }
            if ( send_data_retrieval_response[ifx] ) {
                float value;
                if ( retrieved_data_type == TUNING_VARIABLE ) {
                    switch ( retrieved_var_id ) {
                    case MOTION_THRESHOLD:
                        value = (((struct flash_cal_data *)flashdata)->fusiondata).motion_detect_thresh_g;
                        tuning_var_status = DATA_GETSET_SUCCESS;
                        break;
                    case YAW_STABLE_THRESHOLD:
                        value = (((struct flash_cal_data *)flashdata)->fusiondata).yaw_change_detect_thresh_deg;
                        tuning_var_status = DATA_GETSET_SUCCESS;
                        break;
                    case SEA_LEVEL_PRESSURE:
                        value = (((struct flash_cal_data *)flashdata)->fusiondata).sealevel_pressure_millibars;
                        tuning_var_status = DATA_GETSET_SUCCESS;
                        break;
                    case MAG_DISTURBANCE_THRESHOLD:
                        value = (((struct flash_cal_data *)flashdata)->magcaldata).mag_disturbance_ratio;
                        tuning_var_status = DATA_GETSET_SUCCESS;
                        break;
                    default:
                        /* Invalid case - return error */
                        value = 0;
                        tuning_var_status = DATA_GETSET_ERROR;
                        break;
                    }
                    num_resp_bytes[ifx] += AHRSProtocol::encodeTuningVariableCmd(response_buffer[ifx] + num_resp_bytes[ifx], DATA_GET, retrieved_var_id, value );
                } else if ( retrieved_data_type == MAG_CALIBRATION ) {
                    num_resp_bytes[ifx] += AHRSProtocol::encodeMagCalCommand(response_buffer[ifx] + num_resp_bytes[ifx], DATA_GET,
                            (int16_t *)&((struct flash_cal_data *)flashdata)->magcaldata.bias,
                            (float *)&((struct flash_cal_data *)flashdata)->magcaldata.xform,
                            ((struct flash_cal_data *)flashdata)->magcaldata.earth_mag_field_norm);
                } else if ( retrieved_data_type == BOARD_IDENTITY ) {
                    num_resp_bytes[ifx] += AHRSProtocol::encodeBoardIdentityResponse(response_buffer[ifx] + num_resp_bytes[ifx],
                            registers.identifier,
                            registers.hw_rev,
                            registers.fw_major,
                            registers.fw_minor,
                            NAVX_MXP_REVISION,
                            (uint8_t *)&chipid );
                }
            }
            if ( send_integration_control_response[ifx] ) {
                num_resp_bytes[ifx] += AHRSProtocol::encodeIntegrationControlResponse(response_buffer[ifx] + num_resp_bytes[ifx],
                        integration_control_action,
                        integration_control_parameter );
            }
        }

        /* Transmit Updates over available serial interface(s)                  */
        /* Transmit responses (if any) over the appropriate serial interface    */
        for ( int ifx = 0; ifx < num_serial_interfaces; ifx++ ) {
            if ( num_resp_bytes[ifx] > 0 ) {
                memcpy(update_buffer[ifx] + num_update_bytes[ifx], response_buffer[ifx], num_resp_bytes[ifx]);
            }
            if ( ( num_update_bytes[ifx] + num_resp_bytes[ifx] ) > 0 ) {
                serial_interfaces[ifx]->write(update_buffer[ifx],num_update_bytes[ifx] + num_resp_bytes[ifx]);
            }
        }

        /* Shadow the calibration status into the upper 8-bits of the sensor status. */
        registers.sensor_status &= 0x00FF;
        registers.sensor_status |= ((uint16_t)registers.cal_status << 8);
        /* Update shadow registers; disable i2c/spi interrupts around this access. */
        if ( num_update_bytes[0] > 0 ) {
            NVIC_DisableIRQ((IRQn_Type)I2C3_EV_IRQn);
            NVIC_DisableIRQ((IRQn_Type)SPI1_IRQn);
            NVIC_DisableIRQ((IRQn_Type)DMA2_Stream0_IRQn);
            memcpy(&shadow_registers, &registers, sizeof(registers));
            NVIC_EnableIRQ((IRQn_Type)DMA2_Stream0_IRQn);
            NVIC_EnableIRQ((IRQn_Type)SPI1_IRQn);
            if ( prepare_i2c_receive_timeout_count > 0 ) {
                if ( (HAL_GetTick() - prepare_i2c_receive_last_attempt_timestamp) > (unsigned long)5000) {
                    if ( HAL_OK == prepare_next_i2c_receive() ) {
                        prepare_i2c_receive_timeout_count = 0;
                    }
                }
            }
            NVIC_EnableIRQ((IRQn_Type)I2C3_EV_IRQn);
           	HAL_AHRS_Int_Assert();
        }

        /* Peform I2C Glitch Detection/Correction */
        if ( i2c_rx_in_progress ) {
            if ( HAL_GetTick() - last_i2c_rx_start_timestamp > (uint32_t)40 ) {
                if ( ( hi2c3.XferCount != 0 ) &&
                        ( hi2c3.XferSize > hi2c3.XferCount ) ) {
                    if ( ( hi2c3.Instance->CR2 & (I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR) ) == 0 ) {
                        i2c_glitch_count++;
                        __HAL_I2C_ENABLE_IT(&hi2c3, I2C_IT_EVT | I2C_IT_BUF | I2C_IT_ERR);
                    }
                }
            }
        }

