kauailabs/navxmxp/stm32/navx-mxp/navx-mxp.cpp
        for ( int i = 0; i < NUM_SPI_BANKS; i++) {
        	if ( p_loop_func[i] != NULL ) {
        		p_loop_func[i]();
        	}
        }
    }
}

__STATIC_INLINE uint8_t *GetRegisterAddressAndMaximumSize( uint8_t register_address, uint16_t& size )
{
    if ( register_address > NAVX_REG_LAST ) {
        size = 0;
        return 0;
    }
    uint8_t *register_base = (uint8_t *)&shadow_registers;
    size = (NAVX_REG_LAST + 1) - register_address;
    return register_base + register_address;
}

uint8_t i2c_tx_buffer[NAVX_REG_LAST + 1];
volatile unsigned long last_i2c_tx_start_timestamp = 0;
volatile bool i2c_tx_in_progress = false;
#define I2C_TX_TIMEOUT_MS ((unsigned long)100)
#define I2C_PREPARE_RECEIVE_TIMEOUT_MS  ((unsigned long)100)
#define I2C_PREPARE_TRANSMIT_TIMEOUT_MS  ((unsigned long)100)
int i2c_error_count = 0;
HAL_I2C_ErrorTypeDef last_i2c_err_code = HAL_I2C_ERROR_NONE;

void i2c_hard_reset()
{
    HAL_I2C_DeInit(&hi2c3);
    /* Perform software reset */
    hi2c3.Instance->CR1 |= 0x8000;
    /* Clear all registers */
    hi2c3.Instance->CR1 = 0;
    hi2c3.Instance->CR2 = 0;
    hi2c3.Instance->CCR = 0;
    hi2c3.Instance->TRISE = 0;
    hi2c3.Instance->SR1 = 0;
    hi2c3.Instance->SR2 = 0;
    hi2c3.Instance->OAR1 = 0;
    hi2c3.Instance->OAR2 = 0;
    /* Release software reset */
    hi2c3.Instance->CR1 &= ~0x8000;
    HAL_I2C_Init(&hi2c3);
}

/* Prepare for next reception on the I2C3 (external control) port */
/* This function includes a retry mechanism, and also will reset  */
/* the port in case of a timeout.                                 */

HAL_StatusTypeDef prepare_next_i2c_receive()
{
    HAL_StatusTypeDef status = HAL_I2C_Slave_Receive_IT(&hi2c3, (uint8_t*)i2c3_RxBuffer, 2);
    if ( status == HAL_BUSY ) {
        unsigned long prepare_i2c_receive_last_attempt_timestamp = HAL_GetTick();
        while ( status == HAL_BUSY )
        {
            status = HAL_I2C_Slave_Receive_IT(&hi2c3, (uint8_t*)i2c3_RxBuffer, 2);
            if ( (HAL_GetTick() - prepare_i2c_receive_last_attempt_timestamp) > I2C_PREPARE_RECEIVE_TIMEOUT_MS) {
                HAL_I2C_DeInit(&hi2c3);
                HAL_I2C_Init(&hi2c3);
                status = HAL_I2C_Slave_Receive_IT(&hi2c3, (uint8_t*)i2c3_RxBuffer, 2);
                if ( status != HAL_OK ) {
                    i2c_hard_reset();
                    status = HAL_I2C_Slave_Receive_IT(&hi2c3, (uint8_t*)i2c3_RxBuffer, 2);
                    if ( status != HAL_OK ) {
                        prepare_i2c_receive_timeout_count++;
                    }
                }
                break;
            }
        }
    }
    if ( status == HAL_OK ) {
        i2c_rx_in_progress = true;
        last_i2c_rx_start_timestamp = HAL_GetTick();
    }
    return status;
}

void process_writable_register_update( uint8_t requested_address, uint8_t *reg_addr, uint8_t value )
{
    if ( requested_address == NAVX_REG_UPDATE_RATE_HZ ) {
        *reg_addr = clip_sample_rate(value);
        new_sample_rate = *reg_addr;
        sample_rate_update = true;
    } else if ( requested_address == NAVX_REG_INTEGRATION_CTL) {
        /* This is a write-only register                        */
    	/* Thus, only setting of bits is allowed here (clearing */
    	/* of bits is performed in the foreground).             */
        new_integration_control |= value;
        integration_control_update = true;
    }
}

int unexpected_receive_size_count = 0;
int i2c_short_xfer_request_count = 0;
int i2c_long_xfer_request_count = 0;
int i2c_too_long_xfer_request_count = 0;
int i2c_tx_complete_count = 0;
int i2c_last_requested_read_address = 0;

void HAL_I2C_SlaveRxCpltCallback(I2C_HandleTypeDef *I2cHandle)
{
    HAL_StatusTypeDef status;
    uint8_t *reg_addr;
    uint16_t max_size;
    uint16_t num_bytes_received = I2cHandle->XferSize - I2cHandle->XferCount;
    uint8_t *rx_bytes_start = I2cHandle->pBuffPtr - num_bytes_received;
    bool i2c_transmitting = false;
    bool write = false;
    i2c_rx_in_progress = false;
    if ( I2cHandle->Instance == I2C3 ) {
        if ( I2cHandle->Instance->SR2 & I2C_SR2_TRA ) {
        } else {
            /* Master Receive bit set:  request from master received. */
            bool valid_request;
            uint8_t requested_address;
            uint8_t num_bytes;
            if ( num_bytes_received == 1 ) {
                /* If 1 byte is received, the byte specifies the beginning address    */
                /* Setup for a burst read of the maximum possible length.  If the     */
                /* Master desires less, they will send a NAK (see I2C error handler). */
                requested_address = rx_bytes_start[0];
                i2c_last_requested_read_address = requested_address;
                num_bytes = (NAVX_REG_LAST + 1) - requested_address;
                valid_request = true;
                i2c_short_xfer_request_count++;
            }
            else if ( num_bytes_received == 2 ) {
                /* If two bytes are received, the first indicates the beginning address */
                /* Setup for a burst read with a length specifed in the second byte.    */
                requested_address = rx_bytes_start[0];
                i2c_last_requested_read_address = requested_address;
                num_bytes = rx_bytes_start[1];
                valid_request = true;
                i2c_long_xfer_request_count++;
            } else {
                /* Invalid request. */
                valid_request = false;
                i2c_too_long_xfer_request_count++;
            }
            if ( valid_request ) {
                if ( requested_address & 0x80 ) {
                    write = true;
                    requested_address &= ~0x80;
                }
                reg_addr = GetRegisterAddressAndMaximumSize(requested_address, max_size);
                if ( reg_addr ) {
                    if ( write ) {
                        process_writable_register_update( requested_address, reg_addr, num_bytes /* value */ );
                    } else {
                        uint8_t i2c_bytes_to_be_transmitted = (num_bytes > max_size) ? max_size : num_bytes;
                        memcpy(i2c_tx_buffer,reg_addr,i2c_bytes_to_be_transmitted);
                        status = HAL_BUSY;
                        unsigned long prepare_i2c_tx_last_attempt_timestamp = 0;
                        while ( status == HAL_BUSY )
                        {
                            status = HAL_I2C_Slave_Transmit_DMA(&hi2c3, i2c_tx_buffer, i2c_bytes_to_be_transmitted);
                            if ( status == HAL_OK ) {
                                i2c_transmitting = true;
                                i2c_tx_in_progress = true;
                                last_i2c_tx_start_timestamp = HAL_GetTick();
                                break;
                            } else {
                                /* I2C Transmit not ready to request start.     */
                                /* If timeout waiting occurs, the I2C interface */
                                /* likely needs to be reset.                    */
                                if ( prepare_i2c_tx_last_attempt_timestamp == 0 ) {
                                    prepare_i2c_tx_last_attempt_timestamp = HAL_GetTick();
                                } else if ( HAL_GetTick() - prepare_i2c_tx_last_attempt_timestamp >
                                            I2C_PREPARE_TRANSMIT_TIMEOUT_MS) {
                                    /* Transmit aborted, client will need to */
                                    /* timeout.                              */
                                    i2c_hard_reset();
                                    break;
                                }
                            }
                        }
                    }
                }
            }
            else {
                unexpected_receive_size_count++;
            }
        }
        if ( !i2c_transmitting ) {
            i2c_tx_in_progress = false;
            prepare_next_i2c_receive();
        }
    }
}

void HAL_I2C_SlaveTxCpltCallback(I2C_HandleTypeDef *I2cHandle)
{
    HAL_StatusTypeDef status;
    if ( I2cHandle->Instance == I2C3 )
    {
        i2c_tx_in_progress = false;
        status = prepare_next_i2c_receive();
    }
}

