kauailabs/navxmxp/stm32/navx-mxp/navx-mxp.cpp
int i2c_error_af_ignored_count = 0;
int i2c_error_af_count = 0;
int i2c_error_timeout_count = 0;
int i2c_error_dma_count = 0;
int i2c_error_arlo_count = 0;
int i2c_error_berr_count = 0;
int i2c_error_ovr_count = 0;
int i2c_error_other_count = 0;
int i2c_error_while_rx_in_progress_count = 0;
int i2c_error_while_tx_in_progress_count = 0;
int i2c_num_bytes_transferred_before_last_nack = 0;

void HAL_I2C_ErrorCallback(I2C_HandleTypeDef *I2cHandle)
{
    /* The "AF" (Ack fail) error will occur in the case of a burst read */
    /* if the receiver terminates the read before all bytes are         */
    /* transmitted.  In this case, simply clear the transmit buffer     */
    /* pointer; else, reset the I2C interface.                          */
    if ( I2cHandle->Instance == I2C3 )
    {
        last_i2c_err_code = I2cHandle->ErrorCode;
        if ( I2cHandle->ErrorCode == HAL_I2C_ERROR_AF ) {
            i2c_num_bytes_transferred_before_last_nack = I2cHandle->XferSize - I2cHandle->XferCount;
            I2cHandle->XferCount = 0;
            I2cHandle->XferSize = 0;
            I2cHandle->pBuffPtr = 0;
            i2c_error_af_count++;
        } else {
            if ( I2cHandle->ErrorCode == HAL_I2C_ERROR_TIMEOUT ) {
                i2c_error_timeout_count++;
            }
            else if ( I2cHandle->ErrorCode == HAL_I2C_ERROR_DMA ) {
                i2c_error_dma_count++;
            }
            else if ( I2cHandle->ErrorCode == HAL_I2C_ERROR_ARLO ) {
                i2c_error_arlo_count++;
            }
            else if ( I2cHandle->ErrorCode == HAL_I2C_ERROR_BERR ) {
                i2c_error_berr_count++;
            }
            else if ( I2cHandle->ErrorCode == HAL_I2C_ERROR_OVR ) {
                i2c_error_ovr_count++;
            }
            HAL_I2C_DeInit(I2cHandle);
            HAL_I2C_Init(I2cHandle);
            i2c_error_other_count++;
        }

        if ( i2c_rx_in_progress ) {
            i2c_rx_in_progress = false;
            i2c_error_while_rx_in_progress_count++;
        }
        if ( i2c_tx_in_progress ) {
            i2c_tx_in_progress = false;
            i2c_error_while_tx_in_progress_count++;
        }
        prepare_next_i2c_receive();
        i2c_error_count++;
    }
}

typedef enum  {
    NONE,
    WRITE_REQ,    /* SPI Master sent write request to SPI Slave */
    READ_REQ,     /* SPI Master sent read request to SPI Slave. */
    READ_RESP,    /* SPI Slave is sending reponse to read request from SPI Master. */
    SLAVE_RX_ERR, /* SPI Slave received an invalid request, which was discarded, or rx overflow occurred. */
    SLAVE_TX_ERR  /* Error occurred during SPI Slave transmit [NOTE:  not an error if BUSY error occurs. */
} SPI_MSG_TYPE;

bool spi_transmitting = false;                  // TRUE:  SPI Slave Transmit in progress (awaiting Master to complete Read)
SPI_MSG_TYPE spi_last_valid_msg_type = NONE;    // Previous valid spi transaction type
SPI_MSG_TYPE spi_last_err_msg_type = NONE;      // Previous invalid spi transaction type
uint8_t spi_last_read_req_len = 0;              // # Bytes to be transmitted in curr/previous SPI Slave Transmit
uint8_t spi_last_read_req_reg_addr = 0;         // Starting register address of last READ_REQ
uint8_t spi_last_read_req_bank = 0;             // Register Bank # of last READ_REQ
uint8_t spi_last_write_req_len = 0;             // # Bytes last written in curr/previous WRITE_REQ
uint8_t spi_last_write_req_reg_addr = 0;        // Starting register address of last WRITE_REQ
uint8_t spi_last_write_req_bank = 0;            // Register Bank # of last WRITE_REQ
uint32_t spi_SR_at_beginning_of_last_write = 0;
unsigned long last_spi_tx_start_timestamp = 0;  // Timestamp when last SPI Slave Transmit was initiated
#define SPI_TX_TIMEOUT_MS ((unsigned long)10)   // Max allowed duration of in-progress SPI Slave Transmit

/* SPI Error Counts */
int wrong_size_spi_receive_count = 0;           // SPI Slave Receive w/invalid byte count
int invalid_char_spi_receive_count = 0;         // SPI Slave Receive w/CRC err, bad address or count
int invalid_reg_address_spi_count = 0;          // SPI Slave Receive contained Invalid Register Address
int spi_error_count = 0;                        // SPI Slave Error Callback count
int spi_ovr_error_count = 0;                    // SPI Slave Receive Overflow count
int spi_txne_error_count = 0;                   // SPI Slave Transmit (TXNE) Underflow count [e.g., DMA Underrun;
                                                // (this can also occur during cleanup of a SPI Transmit Timeout)
int spi_rxne_error_count = 0;                   // During SPI Slave Receive, data lost because RX register was full
int spi_busy_error_count = 0;                   // SPI Busy after SPI Slave Transmit completed [caused by Silicon bug]
int spi_rx_while_tx_error_count = 0;            // SPI Data Receive Callback invoked during SPI Slave Transmit ['impossible' condition]
int spi_tx_complete_timeout_count = 0;          // SPI Slave Transmit completion timeout [protocol error]
uint32_t last_spi_tx_complete_timeout_xfer_size = 0;
uint32_t last_spi_tx_complete_timeout_xfer_count = 0;
uint32_t last_spi_tx_complete_timeout_error_code = 0;
uint32_t last_spi_tx_complete_timeout_SR = 0;

void Reset_SPI_And_PrepareToReceive() {
    HAL_SPI_Comm_Ready_Deassert();
    HAL_SPI_DeInit(&hspi1);
    HAL_SPI_Init(&hspi1);
    spi_transmitting = false;
    __HAL_SPI_CLEAR_OVRFLAG(&hspi1);
    HAL_SPI_Receive_DMA(&hspi1, (uint8_t *)spi1_RxBuffer, SPI_RECV_LENGTH);
    HAL_SPI_Comm_Ready_Assert();
}

// This function should be polled periodically (at least once every
// SPI_TX_TIMEOUT_MS period).
//
// If the SPI transmitter has been waiting more than the timeout period
// to complete the transmission, disable the transmitter and prepare
// again to receive data.
void SpiTxTimeoutCheck() {
    if (spi_transmitting) {
    	unsigned long last_spi_txt_start = last_spi_tx_start_timestamp;
        unsigned long now = HAL_GetTick();
        if (now > last_spi_txt_start) {
        	unsigned long transmit_period = now - last_spi_txt_start;
        	if (transmit_period > SPI_TX_TIMEOUT_MS) {
        		last_spi_tx_complete_timeout_xfer_size = hspi1.TxXferSize;
        		last_spi_tx_complete_timeout_xfer_count = hspi1.TxXferCount;
        		last_spi_tx_complete_timeout_error_code = hspi1.ErrorCode;
        		last_spi_tx_complete_timeout_SR = hspi1.Instance->SR;
        		Reset_SPI_And_PrepareToReceive();
        		spi_tx_complete_timeout_count++;
        	}
        }
    }
}

#ifdef ENABLE_BANKED_REGISTERS
int spi_rx_variable_message_len = 0;
uint8_t dummy;
#endif

uint8_t spi_tx_buffer[255];

void HAL_SPI_RxCpltCallback(SPI_HandleTypeDef *hspi)
{
	if (!ext_spi_init_complete) return;

    uint8_t *reg_addr = 0;
    uint16_t max_size;
    uint8_t reg_address;
    uint8_t reg_count;
    uint8_t received_crc;
    uint8_t calculated_crc;
    uint8_t bank;
    bool write = false;
    if ( hspi->Instance == SPI1 ) {

        if ( !spi_transmitting ) {
            int num_bytes_received = hspi->RxXferSize - hspi->RxXferCount;
#ifdef ENABLE_BANKED_REGISTERS
            uint8_t *received_data;
            if ((num_bytes_received == SPI_RECV_LENGTH ) ||
            	((spi_rx_variable_message_len > 0) && (num_bytes_received == spi_rx_variable_message_len))) {
            	bank = spi1_RxBuffer[0];
            	reg_address = spi1_RxBuffer[1];
            	reg_count = spi1_RxBuffer[2]; /* Bank 0: This is the byte to write; Bank > 0:  count of bytes to be written */
            	received_data = &spi1_RxBuffer[3];
            	if(spi_rx_variable_message_len > 0) {
            		spi_rx_variable_message_len = 0;
            	}
#else
            if ( num_bytes_received == SPI_RECV_LENGTH ) {
            	bank = 0;
                reg_address = spi1_RxBuffer[0];
                reg_count = spi1_RxBuffer[1];
#endif
                received_crc = spi1_RxBuffer[num_bytes_received-1];
                calculated_crc = IMURegisters::getCRCWithTable(crc_lookup_table,spi1_RxBuffer,num_bytes_received-1);
                if ( ( reg_address != 0xFF ) && (reg_count > 0 ) && ( received_crc == calculated_crc ) ) {
                    if ( reg_address & 0x80 ) {
                        write = true;
                        reg_address &= ~0x80;
                    }
#ifdef ENABLE_BANKED_REGISTERS
                    if (bank < NUM_SPI_BANKS) {
                    	if (bank == 0) {
                           	reg_addr = GetRegisterAddressAndMaximumSize(reg_address, max_size);
                    	} else if (p_reg_lookup_func[bank] != NULL) {
                    		reg_addr = p_reg_lookup_func[bank](bank, reg_address, reg_count, &max_size);
                    	}
                    } else if (bank == COMM_MODE_BANK) {
                    	reg_addr = &dummy; /* Special mode does not access reg_addr */
                    } else if (bank >= NUM_SPI_BANKS) {
                    	reg_addr = 0; /* Invalid Bank Requested */
                    }
                    else
#endif
                    {
                    	reg_addr = GetRegisterAddressAndMaximumSize(reg_address, max_size);
                    }
                    if ( reg_addr ) {
                    	if ( write ) {
                    	    // Write Request
                    		HAL_SPI_Comm_Ready_Deassert();
                    		uint8_t next_rcv_size = SPI_RECV_LENGTH;
#ifdef ENABLE_BANKED_REGISTERS
                    		if (bank <= NUM_SPI_BANKS) {
                    			if (bank == 0) {
                               		process_writable_register_update( reg_address, reg_addr, reg_count /* value */ );
                    			} else if(p_reg_write_func[bank] != NULL) {
                    				p_reg_write_func[bank](bank, reg_address, reg_addr, reg_count, received_data);
                    			}
                    		} else if (bank == COMM_MODE_BANK) {
                            	if (reg_address == COMM_MODE_REG_VARIABLEWRITE ) {
                            		/* Next transaction is variable len write; len is in defined by count */
                            		next_rcv_size = reg_count;
                            		spi_rx_variable_message_len = next_rcv_size;
                            	}
                            }
#else
                    		process_writable_register_update( reg_address, reg_addr, reg_count /* value */ );
#endif

