kauailabs/navxmxp/stm32/navx-mxp/navx-mxp.cpp
							spi_last_valid_msg_type = WRITE_REQ;
                            spi_last_write_req_len = (bank == 0) ? 1 : reg_count;
                            spi_last_write_req_reg_addr = reg_address;
                            spi_last_write_req_bank = bank;
                            __HAL_SPI_CLEAR_OVRFLAG(hspi);
                    		HAL_SPI_Receive_DMA(&hspi1, (uint8_t *)spi1_RxBuffer, next_rcv_size);
                            HAL_SPI_Comm_Ready_Assert();
                        } else {
                            // Read Request
                            if (bank == 0) {
                                HAL_AHRS_Int_Deassert();
                            }
                        	spi_transmitting = true;
                            spi_last_read_req_len = (reg_count > max_size) ? max_size : reg_count;
                            spi_last_read_req_reg_addr = reg_address;
                            spi_last_read_req_bank = bank;
                            memcpy(spi_tx_buffer,reg_addr,spi_last_read_req_len);
                            spi_tx_buffer[spi_last_read_req_len] =
                                    IMURegisters::getCRCWithTable(crc_lookup_table, spi_tx_buffer,
                                                                  (uint8_t)spi_last_read_req_len);
                            spi_last_valid_msg_type = READ_REQ;
                            spi_SR_at_beginning_of_last_write = hspi->Instance->SR;
                            __HAL_SPI_CLEAR_OVRFLAG(hspi);
                            __HAL_SPI_DISABLE(hspi);
                            HAL_SPI_Transmit_DMA(&hspi1, spi_tx_buffer, spi_last_read_req_len+1);
                            last_spi_tx_start_timestamp = HAL_GetTick();
                        	HAL_SPI_Comm_Ready_Deassert();
                        }
                    } else {
                        invalid_reg_address_spi_count++;
                        spi_last_err_msg_type = SLAVE_RX_ERR;
                        __HAL_SPI_CLEAR_OVRFLAG(hspi);
                        HAL_SPI_Receive_DMA(&hspi1, (uint8_t *)spi1_RxBuffer, SPI_RECV_LENGTH);
                        HAL_SPI_Comm_Ready_Assert();
                    }
                } else {
                    invalid_char_spi_receive_count++;
                    spi_last_err_msg_type = SLAVE_RX_ERR;
                    /* If repeated invalid requests are received, and if the */
                    /* SPI interface is still busy, reset the SPI interface. */
                    /* This condition can occurs sometimes after the         */
                    /* host computer is power-cycled.                        */
#if 0
                    if ( ( (invalid_char_spi_receive_count % 5) == 0 ) &&
                         ( __HAL_SPI_GET_FLAG(&hspi1,SPI_FLAG_BSY) != RESET ) ) {
                        Reset_SPI_And_PrepareToReceive();
                   } else {
                       Reset_SPI_And_PrepareToReceive();
                       HAL_SPI_Comm_Ready_Assert(); /* This shouldn't be necessary - remove it! */
                   }
#endif
                    if ( ( __HAL_SPI_GET_FLAG(&hspi1,SPI_FLAG_BSY) != RESET ) ) {
                        Reset_SPI_And_PrepareToReceive();
                   } else {
#ifdef ENABLE_BANKED_REGISTERS
						if(spi_rx_variable_message_len > 0) {
							spi_rx_variable_message_len = 0;
						}
#endif
						__HAL_SPI_CLEAR_OVRFLAG(hspi);
                       HAL_SPI_Receive_DMA(&hspi1, (uint8_t *)spi1_RxBuffer, SPI_RECV_LENGTH);
                	   HAL_SPI_Comm_Ready_Assert();
                   }
                }
            } else {
                spi_last_err_msg_type = SLAVE_RX_ERR;
                wrong_size_spi_receive_count++;
#ifdef ENABLE_BANKED_REGISTERS
            	if(spi_rx_variable_message_len > 0) {
            		spi_rx_variable_message_len = 0;
            	}
#endif
                __HAL_SPI_CLEAR_OVRFLAG(hspi);
                HAL_SPI_Receive_DMA(&hspi1, (uint8_t *)spi1_RxBuffer, SPI_RECV_LENGTH);
                HAL_SPI_Comm_Ready_Assert();
            }
        } else {
            // A SPI receive event occurred while transmitting.  This should never happen!
            spi_rx_while_tx_error_count++;
        }
    }
}

void HAL_SPI_ErrorCallback(SPI_HandleTypeDef *hspi)
{
    if ( hspi->Instance == SPI1 ) {
        /* HAL_SPI_ERROR_OVR: Master has transmitted bytes, the slave hasn't read the */
        /* previous byte in the receive register.  This case occurs when the          */
        /* Receive ISR hasn't been responded to before the master starts writing.     */

        /* Clear the error, and prepare for next receive.                             */
        spi_error_count++;
        if ((hspi->ErrorCode & HAL_SPI_ERROR_OVR) != 0) {
            __HAL_SPI_CLEAR_OVRFLAG(hspi);
            spi_last_err_msg_type = spi_transmitting ? SLAVE_TX_ERR : SLAVE_RX_ERR;
            spi_ovr_error_count++;
        }

        if ((hspi->ErrorCode == HAL_SPI_ERROR_FLAG) != 0) {
        	/* Either RXNE,TXE, BSY flags are set.  It's also possible the OVR flag is set. */
        	uint32_t status_bits = hspi->Instance->SR;
        	if (status_bits & 0x00000001) {
        	    spi_last_err_msg_type = spi_transmitting ? SLAVE_TX_ERR : SLAVE_RX_ERR;
        	    spi_rxne_error_count++;
        	}
        	if (spi_transmitting) {
        	    // Transmitter NE is only an error during SPI Slave Transmit
        	    if ((status_bits & 0x00000002) == 0) {
        	        spi_last_err_msg_type = SLAVE_TX_ERR;
        	        spi_txne_error_count++;
        	    }
        	}
        	if (status_bits & 0x00000040) {
                __HAL_SPI_CLEAR_OVRFLAG(hspi);
                spi_last_err_msg_type = spi_transmitting ? SLAVE_TX_ERR : SLAVE_RX_ERR;
                spi_ovr_error_count++;
        	}
        	if (status_bits & 0x00000080) {
        	    // NOTE:  This occurs often due to a silicon bug
        	    // Therefore, this is not considered a SLAVE_TX_ERR.
        		spi_busy_error_count++;
                /* Disable the SPI, which clears the busy condition   */
        		/* (SPI will be reenabled upon the next invocation of */
        		/* HAL_SPI_Receive_DMA or HAL_SPI_Transmit_DMA)       */
                __HAL_SPI_DISABLE(hspi);
        	}
        }
        spi_transmitting = false;
        HAL_SPI_Receive_DMA(&hspi1, (uint8_t *)spi1_RxBuffer, SPI_RECV_LENGTH);
        HAL_SPI_Comm_Ready_Assert();
    }
}

void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi)
{
    if ( hspi->Instance == SPI1 ) {
        spi_transmitting = false;
        __HAL_SPI_CLEAR_OVRFLAG(hspi);
        HAL_SPI_Receive_DMA(&hspi1, (uint8_t *)spi1_RxBuffer, SPI_RECV_LENGTH);
        HAL_SPI_Comm_Ready_Assert();
    }
}
